<a href="https://colab.research.google.com/github/mehovsky-zenit-champion/ProjectIS/blob/main/%D0%9F%D1%80%D0%B0%D0%BA%D1%82%D0%B8%D0%BA%D0%B0_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
from IPython.display import display

In [3]:
data=pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header=None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [4]:
names=["Id", "RI", "Na", "Mg", "Al", "Si", "K", "Ca", "Ba", "Fe", "class"]
data.columns=names
data=data.drop(columns=['Id'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [13]:
data['class'].replace({1:"building_float", 2:"boilding_not_float", 3:"vehicle_float", 4:"vehicle_non_float", 5:"containers", 6:"tableware", 7:"headlamps"}, inplace=True)
data['class'].value_counts()

boilding_not_float    65
building_float        61
headlamps             28
vehicle_float         15
containers             9
tableware              9
Name: class, dtype: int64

In [9]:
for col in data.columns:
  fr=np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col]=np.nan
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      178 non-null    float64
 1   Na      191 non-null    float64
 2   Mg      183 non-null    float64
 3   Al      184 non-null    float64
 4   Si      186 non-null    float64
 5   K       185 non-null    float64
 6   Ca      184 non-null    float64
 7   Ba      182 non-null    float64
 8   Fe      186 non-null    float64
 9   class   187 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

#Vizualization

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      178 non-null    float64
 1   Na      191 non-null    float64
 2   Mg      183 non-null    float64
 3   Al      184 non-null    float64
 4   Si      186 non-null    float64
 5   K       185 non-null    float64
 6   Ca      184 non-null    float64
 7   Ba      182 non-null    float64
 8   Fe      186 non-null    float64
 9   class   187 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [11]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  178.000000  191.000000  183.000000  ...  184.000000  182.000000  186.000000
mean     1.518232   13.402513    2.676776  ...    8.997609    0.156703    0.055215
std      0.002914    0.830316    1.429411  ...    1.388705    0.426989    0.094755
min      1.511310   10.730000    0.000000  ...    5.870000    0.000000    0.000000
25%      1.516473   12.915000    1.985000  ...    8.270000    0.000000    0.000000
50%      1.517630   13.290000    3.480000  ...    8.600000    0.000000    0.000000
75%      1.519038   13.805000    3.600000  ...    9.140000    0.000000    0.097500
max      1.533930   17.380000    3.980000  ...   16.190000    2.200000    0.510000

[8 rows x 9 columns]

In [14]:
data["class"].describe()

count                    187
unique                     6
top       boilding_not_float
freq                      65
Name: class, dtype: object

In [16]:
data["class"].value_counts()

boilding_not_float    65
building_float        61
headlamps             28
vehicle_float         15
containers             9
tableware              9
Name: class, dtype: int64

In [17]:
display(data["class"].describe())
display(print("===================================="))
display(data['class'].value_counts())

count                    187
unique                     6
top       boilding_not_float
freq                      65
Name: class, dtype: object

====================================

None

boilding_not_float    65
building_float        61
headlamps             28
vehicle_float         15
containers             9
tableware              9
Name: class, dtype: int64